
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.Товары.Записывать = Истина;
	
	ТаблицаДляПроведения = Товары.Выгрузить();
	ТаблицаДляПроведения.Свернуть("Номенклатура", "Количество, Сумма");
	
	Для Каждого Строка из Товары Цикл	
		Если Строка.Номенклатура = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Количество = Строка.Количество;
		Движение.Период = Дата;
		Движение.Сумма = Строка.Сумма;
	КонецЦикла;	
		 
КонецПроцедуры
