Функция ИННВерен(ИНН)Экспорт
	
	Коэффициенты = Новый Массив(9);
	Коэффициенты[0] = 2;
	Коэффициенты[1] = 4;
	Коэффициенты[2] = 10;
	Коэффициенты[3] = 3;
	Коэффициенты[4] = 5;
	Коэффициенты[5] = 9;
	Коэффициенты[6] = 4;
	Коэффициенты[7] = 6;
	Коэффициенты[8] = 8;
	
	СуммаПроизведенийЦифрИНН = 0;
	
	Для Сч = 0 По 8 Цикл
		ЦифраИНН = Сред(ИНН, Сч + 1, 1);
		СуммаПроизведенийЦифрИНН = СуммаПроизведенийЦифрИНН + Коэффициенты[Сч] * ЦифраИНН;  
	КонецЦикла;
	
	ОстатокОтДеления = СуммаПроизведенийЦифрИНН - 11 * Цел(СуммаПроизведенийЦифрИНН / 11);
	КонтрольныйРазряд = ОстатокОтДеления % 10;
	ПоследняяЦифраИНН = Число(Сред(ИНН, 10, 1));
	РезультатСравнения = (ПоследняяЦифраИНН = КонтрольныйРазряд); 
		
	Возврат РезультатСравнения;

КонецФункции
