
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Согласовано Тогда	
		Элементы.ГруппаЦена.Доступность = Ложь;
		Элементы.Дата.Доступность = Ложь;
		Элементы.Номер.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
	Иначе 
		Элементы.ГруппаЦена.Доступность = Истина;
		Элементы.Дата.Доступность = Истина;
		Элементы.Номер.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Ответственный.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
	КонецЕсли
	
КонецПроцедуры
