
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	ТаблицаДляПроведения = Товары.Выгрузить();
	ТаблицаДляПроведения.Свернуть("Номенклатура", "Количество, Сумма");
	
	Для Каждого Строка из Товары Цикл		
		Движение = Движения.Продажи.Добавить();
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Сотрудник = Ответственный;
		Движение.Период = Дата;
		Движение.Сумма = Строка.Сумма;
		
		Если Строка.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Номенклатура", Строка.Номенклатура);
		ОстаткиПоНоменклатуре = РегистрыНакопления.Товары.Остатки(Дата, Отбор);
		
		Если ОстаткиПоНоменклатуре.Количество() = 0 Тогда
            Сообщить(СтрШаблон("На складе отстутствует товар %1", Строка.Номенклатура));
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокаОстатка = ОстаткиПоНоменклатуре[0];
		Если СтрокаОстатка.Количество < Строка.Количество Тогда
			ОстаткиНаСкладе  = СтрокаОстатка.Количество - Строка.Количество;
			Сообщить(СтрШаблон("На складе недостаточно товара %1 в количестве %2", Строка.Номенклатура, -ОстаткиНаСкладе));
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		СуммаКСписанию = 0;
		Если СтрокаОстатка.Количество = Строка.Количество Тогда
			СуммаКСписанию = СтрокаОстатка.Сумма;
		Иначе
			СуммаКСписанию = СтрокаОстатка.Сумма / СтрокаОстатка.Количество * Строка.Количество;
		КонецЕсли;
		
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Количество = Строка.Количество;
		Движение.Период = Дата;
		Движение.Сумма = СуммаКСписанию;
	КонецЦикла;
	
КонецПроцедуры
