
Процедура ПриНачалеРаботыСистемы()
	
    Сообщить("При начале работы системы: " + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());
		
	ДатаСегодня = ТекущаяДата();
	НачалоРабочегоДня = Дата(Год(ДатаСегодня), Месяц(ДатаСегодня), День(ДатаСегодня), 09, 00, 00);
	КонецРабочегоДня = Дата(Год(ДатаСегодня), Месяц(ДатаСегодня), День(ДатаСегодня), 18, 00, 00);
	ПроверитьДеньНедели = ДеньНедели(ДатаСегодня);
		
	Если ПроверитьДеньНедели <= 5 Тогда
			
		Если ПроверитьДеньНедели = 1 Тогда
			ДеньНеделиСегодня = "Понедельник";
		ИначеЕсли  ПроверитьДеньНедели = 2 Тогда
			ДеньНеделиСегодня = "Вторник";
		ИначеЕсли  ПроверитьДеньНедели = 3 Тогда
			ДеньНеделиСегодня = "Среда";
		ИначеЕсли  ПроверитьДеньНедели = 4 Тогда
			ДеньНеделиСегодня = "Четверг";
		Иначе
			ДеньНеделиСегодня = "Пятница";
		КонецЕсли;
		
		Если ДатаСегодня > НачалоРабочегоДня И ДатаСегодня < КонецРабочегоДня Тогда
			ПроверитьРабочийДень = "Рабочий День. Рабочее время идет.";
		ИначеЕсли ДатаСегодня < НачалоРабочегоДня Тогда
			ПроверитьРабочийДень = "Рабочий День. Рабочее время еще не началось.";
		Иначе
			ПроверитьРабочийДень = "Рабочий День. Рабочее время завершилось.";
		КонецЕсли;

	Иначе
		ПроверитьРабочийДень = "Выходной.";
		Если ПроверитьДеньНедели = 6 Тогда
			ДеньНеделиСегодня = "Суббота";
		Иначе
			ДеньНеделиСегодня = "Воскресенье";
		КонецЕсли;
	КонецЕсли; 
	
	ОпределитьРабочееВремя = СтрШаблон("Сегодня %1, %2", ДеньНеделиСегодня, ПроверитьРабочийДень);
	Сообщить(ОпределитьРабочееВремя);
	
	//Задача 2 "Поздравления"
	
	МассивПраздничныхДат = Новый Массив;
	ДеньСегодня = Формат(ТекущаяДата(), "ДФ=dd");
	ДеньЗавтра = Формат(ТекущаяДата() + 86400, "ДФ=dd");
	МесяцСегодня = Формат(ТекущаяДата(), "ДФ=MM");
	
	НазваниеПраздника = Новый Структура;
	НазваниеПраздника.Вставить("День", "27");
	НазваниеПраздника.Вставить("Месяц", "11");
	НазваниеПраздника.Вставить("Название", "Международный день бухгалтерии");
	МассивПраздничныхДат.Добавить(НазваниеПраздника); 
	
	НазваниеПраздника = Новый Структура;
	НазваниеПраздника.Вставить("День", "28");
	НазваниеПраздника.Вставить("Месяц", "11"); 
	НазваниеПраздника.Вставить("Название", "Международный день кадровых работников");
	МассивПраздничныхДат.Добавить(НазваниеПраздника);
	
	НазваниеПраздника = Новый Структура;
	НазваниеПраздника.Вставить("День", "29");
	НазваниеПраздника.Вставить("Месяц", "11"); 
	НазваниеПраздника.Вставить("Название", "Международный день кино");
	МассивПраздничныхДат.Добавить(НазваниеПраздника);
	
	Для Каждого ПраздничныйДень Из МассивПраздничныхДат Цикл
		
		Если ДеньСегодня = ПраздничныйДень.День И МесяцСегодня = ПраздничныйДень.Месяц Тогда
			Сообщить(СтрШаблон("Поздравляем с праздником! Сегодня %1!", ПраздничныйДень.Название));
		КонецЕсли;
		
		Если ДеньЗавтра = ПраздничныйДень.День И МесяцСегодня = ПраздничныйДень.Месяц Тогда
			Сообщить(СтрШаблон("Поздравляем с наступающим праздником! Завтра %1!", ПраздничныйДень.Название));	
		КонецЕсли;
		
	КонецЦикла;
	
	// Задача 1 "Поздравление с днем рождения" к занятию "Процедуры и функции" 
	
	ДеньИМесяцСегодня = Формат(ТекущаяДата(), "ДФ=dd.MM");
	ДеньРожденияТекущегоПользователя = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	МесяцИДеньРождения = Формат(ДеньРожденияТекущегоПользователя, "ДФ=dd.MM");
	
	Если ДеньИМесяцСегодня = МесяцИДеньРождения Тогда
		Сообщить("У вас сегодня день рождения - поздравляем!");
	КонецЕсли;
	
	// Задача 1 "Версия конфигурации" к занятию "Программная работа со Ссылочными типами. Обновление конфигурации"
	
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();
	
	Сообщить(ТекущаяДата());
КонецПроцедуры     
