
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)  
	
    Сообщить("Установка параметров сеанса: " + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());
	
	ПараметрыСеанса.ВремяНачалаСеанса = ТекущаяДатаСеанса();
	
	
	// Задача 1 "Поздравление с днем рождения" к занятию "Процедуры и функции"
	
	ПолноеИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	НайденныйСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ПолноеИмяПользователя);
	ПараметрыСеанса.СотрудникТекущегоПользователя = НайденныйСотрудник;
	
КонецПроцедуры