
&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	
	ВыборкаДокументы = Документы.ПоступлениеТоваровИУслуг.Выбрать(ДатаНачалаПериода, ДатаЗавершенияПериода);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументы.ПолучитьОбъект();
		Для Каждого СтрокаТЧ ИЗ ДокументОбъект.Товары Цикл
			СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		КонецЦикла;
		ДокументОбъект.Записать();
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокументы(Команда)
	
	ПересчитатьДокументыНаСервере();
	
КонецПроцедуры
