
&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтбор", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	ПолеРодитель = Новый ПолеКомпоновкиДанных("Родитель");
	ВыбранноеЗначение = Элементы.СписокГрупп.ТекущаяСтрока;
	РаботаСФормамиКлиент.УстановитьОтборВСписке(Список, ПолеРодитель, ВыбранноеЗначение);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборЦен", 0.1, Истина);

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьОтборЦен()

	ПолеНоменклатура = Новый ПолеКомпоновкиДанных("Номенклатура");
	ВыбранноеЗначение = Элементы.Список.ТекущаяСтрока;
	РаботаСФормамиКлиент.УстановитьОтборВСписке(СписокЦен, ПолеНоменклатура, ВыбранноеЗначение);

КонецПроцедуры
