
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СписокРаботающихСотрудников = Новый Структура;
	СписокРаботающихСотрудников.Вставить("Уволен", Ложь); 
	ПараметрыФормы = Новый Структура("Отбор", СписокРаботающихСотрудников);
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					"Работающие сотрудники", 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
