
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Требуется согласовать документ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныПоставщиков.Записывать = Истина;
		
	Для Каждого Строка из Цена Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		КоличествоНоменклатуры = Цена.НайтиСтроки(Отбор);
		
		Если КоличествоНоменклатуры.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить("В табличной части документа дублируется наименование номенклатуры");
			Прервать;
		КонецЕсли;
		
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Цена = Строка.Цена;
		Движение.Период = Дата;
		Движение.Ответственный = Ответственный;
	КонецЦикла;
	
КонецПроцедуры
