
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СписокУволенныхСотрудников = Новый Структура;
	СписокУволенныхСотрудников.Вставить("Уволен", Истина); 
	ПараметрыФормы = Новый Структура("Отбор", СписокУволенныхСотрудников);
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					"Уволенные сотрудники", 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
