
&НаСервере
Процедура ПрочитатьГраницуНаСервере()
		
	Граница = Последовательности.СкладскиеДокументы.ПолучитьГраницу();
	ГраницаДата = Граница.Дата;
	ГраницаСсылка = Граница.Ссылка;

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьГраницу(Команда)
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьГраницуНаСервере()
	
	Последовательности.СкладскиеДокументы.Восстановить();
	ПрочитатьГраницуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьГраницу(Команда)
	ВосстановитьГраницуНаСервере();
КонецПроцедуры
