
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.ПолноеНаименование = Объект.Наименование
	
КонецПроцедуры

&НаСервере
Процедура СписокКонтактныхЛицНаСервере()
	
	КонтактныеЛица = Справочники.КонтактныеЛица.Выбрать( , Объект.Ссылка);
	
	Пока КонтактныеЛица.Следующий() Цикл
		НаименованиеКЛ = КонтактныеЛица.Наименование;
		ДолжностьКЛ = КонтактныеЛица.Должность;
		ТелефонКЛ = КонтактныеЛица.Телефон;
		Сообщить(СтрШаблон("Наменование: %1, Должность: %2, Телефон: %3", НаименованиеКЛ, ДолжностьКЛ, ТелефонКЛ)); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	
	СписокКонтактныхЛицНаСервере();
	
КонецПроцедуры
